Repository: StanciuOctav/QuickPlate
Catalog: QuickPlate/*.lproj/Localizable.strings
Languages: ro

source: Confirm?
ro: Confirmi?

source: Yes
ro: Da

source: No
ro: Nu

source: Cancel
ro: Anuleaza

# search-placeholder
source: Search for restaurant...
ro: Cauta restaurant...

source: Welcome!
ro: Bine ai venit!

# signin-message
source: Sign in so you can book a table at your favourite restaurant and to be able to pre-order
ro: Intra in cont pentru a putea rezerva o masa la un restaurant si pentru a seta o precomanda

source: Password
ro: Parola

source: Sign In
ro: Intra in cont

source: or
ro: sau

# signup
source: Create an account
ro: Creeaza un cont nou

# logout
source: Sign Out
ro: Deconectare

# credentials-error
source: Wrong credentials / Account doesn't exist
ro: Credentiale gresite / Cont inexistent

# email-not-verified
source: The email address wasn't verified
ro: Adresa de email nu a fost confirmata

source: Username
ro: Nume utilizator

source: First Name
ro: Prenume

source: Last Name
ro: Nume

source: Account Type
ro: Tipul contului

source: Confirm Password
ro: Confirma parola

# password-format-error
source: Password must have at least 6 characters
ro: Parola trebuie sa contina cel putin 6 caractere

# passwords-match-error
source: The passwords don't match
ro: Parolele difera

source: Back
ro: Inapoi

# created-account-message
source: Verify your email address!
ro: Verifica adresa de email!

source: Back to Sign In
ro: Inapoi la logare

# complete-all-fields-message
source: You need to complete all the fields in order to create a new account
ro: Toate campurile trebuie completate inainte de a se crea un cont

# signup-email-exists-error
source: An account with the same email address already exists!
ro: Adresa de email introdusa este folosita de alt cont!

source: Waiter
ro: Chelner

source: Cook
ro: Bucatar

source: Map
ro: Harta

source: Restaurants
ro: Restaurante

# restaurant-closed
source: Closed
ro: Inchis

source: Rating
ro: Recenzie

source: Ingredients
ro: Ingrediente

source: Price
ro: Pret

source: Menu
ro: Meniu

# book-table
source: Book a table
ro: Rezerva o masa

# no-available-tables
source: We're sorry but all tables are booked at the moment ðŸ˜¢
ro: Ne pare rau, dar nu este nicio masa libera ðŸ˜¢

# book-table-action
source: Book
ro: Rezerva

# choose-hour
source: Please choose an hour
ro: Alege ora

# choose-day
source: Please choose a day
ro: Alege ziua

source: Booking confirmed
ro: Rezervare confirmata

source: Booked tables
ro: Rezervari

source: Favourite Restaurants
ro: Restaurante preferate

# cancel-reservation
source: Are you sure you want to cancel the reservation?
ro: Esti sigur ca vrei sa anulezi rezervarea?

# signout-alert
source: Are you sure you want to Sign Out?
ro: Esti sigur ca vrei sa te deconectezi?

source: Confirm arrival
ro: Confirma sosirea

# no-booked-tables
source: You don't have any booked tables at the moment
ro: Momentan nu aveti nicio rezervare facuta

# no-fav-restaurants
source: You don't have any favourite restaurants yet
ro: Momentan nu aveti niciun restaurant preferat

# send-order-alert
source: You want to send the order?
ro: Confirmi plasarea comenzii?

# no-food-ordered
source: Sorry but you didn't order any food
ro: Ne pare rau, dar nu ai plasat nicio comanda

# unfinished-orders
source: Please wait! You have unprocessed/no orders.
ro: Va rugam sa asteptati! Aveti comenzi neterminate sau nicio comanda plasata.

# reset-order
source: Reset
ro: Reseteaza

# send-order
source: Send
ro: Trimite

source: Request bill
ro: Cere nota

source: Your order
ro: Comanda ta

# select-payment
source: How do you want to pay?
ro: Cum doriti sa achitati?

# pay-bill
source: Choose payment method
ro: Achitati nota de plata

# card-pay
source: By card
ro: Cu cardul

# app-pay
source: Using the app
ro: Folosind aplicatia

# choose-payment
source: Please choose the payment method
ro: Alegeti metoda cu care doriti sa achitati

# payment-confirmation
source: Our staff will get in touch with you shortly!
ro: Unul dintre angajatii nostri o sa vina imediat!

# employee-no-orders
source: There are no orders
ro: Nu sunt comenzi

source: Send to kitchen
ro: Trimite la bucatarie

source: Deliver Order
ro: Serveste comanda

source: Reject Order
ro: Anuleaza comanda

source: Works at:
ro: Lucreaza la:

# order-ready
source: Order is ready
ro: Comanda este gata
